In [8]:
import pandas as pd

In [26]:
import numpy as np

In [9]:
from pandas import Series, DataFrame

Series 可以看做字典

In [10]:
obj = pd.Series([4,7,-5,3])

In [11]:
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [13]:
obj.values

array([ 4,  7, -5,  3], dtype=int64)

In [14]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [19]:
obj2=pd.Series([4,7,-4,3],index=['d','b','a','c'])

In [20]:
obj2

d    4
b    7
a   -4
c    3
dtype: int64

In [21]:
obj2.index

Index(['d', 'b', 'a', 'c'], dtype='object')

In [22]:
obj2['d']

4

In [23]:
obj2[obj2>0]

d    4
b    7
c    3
dtype: int64

In [24]:
obj2*2

d     8
b    14
a    -8
c     6
dtype: int64

In [30]:
np.exp(obj2)

d      54.598150
b    1096.633158
a       0.018316
c      20.085537
dtype: float64

In [31]:
'b' in obj2

True

In [32]:
sdata = {'Ohio':35000, 'Texas':71000, 'Oregon':16000, 'Utah':5000}

In [33]:
obj3 = pd.Series(sdata)

In [34]:
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [35]:
states = ['California','Ohio']

In [39]:
obj4 = pd.Series(sdata, index=states)

In [40]:
obj4

California        NaN
Ohio          35000.0
dtype: float64

In [41]:
pd.isnull(obj4)

California     True
Ohio          False
dtype: bool

In [42]:
pd.notnull(obj4)

California    False
Ohio           True
dtype: bool

In [43]:
obj4.isnull()

California     True
Ohio          False
dtype: bool

In [44]:
print(obj3,'\n',obj4)

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64
 California        NaN
Ohio          35000.0
dtype: float64

In [45]:
obj3+obj4

California        NaN
Ohio          70000.0
Oregon            NaN
Texas             NaN
Utah              NaN
dtype: float64

In [46]:
obj4.name = 'population'

In [47]:
obj4.index.name='state'

In [48]:
obj4

state
California        NaN
Ohio          35000.0
Name: population, dtype: float64

In [49]:
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [51]:
obj.index = ['Bob','Tom','Jeff','Steve']

In [52]:
obj

Bob      4
Tom      7
Jeff    -5
Steve    3
dtype: int64

# dataframe

In [53]:
data={'state':['Ohio','Ohio','Ohio','Nevada','Nevada','Nevada'],
      'year':[2000,2001,2002,2001,2002,2003],
      'pop':[1.5,1.7,3.6,2.4,2.9,3.2]
     }

In [54]:
data

{'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
 'year': [2000, 2001, 2002, 2001, 2002, 2003],
 'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}

In [55]:
frame = pd.DataFrame(data)

In [57]:
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [58]:
frame.head(2)

  state  year  pop
0  Ohio  2000  1.5
1  Ohio  2001  1.7

In [59]:
pd.DataFrame(data, columns=['year','state','pop'])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.2

In [61]:
frame2=pd.DataFrame(data, columns=['year','state','pop','debt'])

In [72]:
frame2

   year   state  pop  debt
0  2000    Ohio  1.5   0.0
1  2001    Ohio  1.7   1.0
2  2002    Ohio  3.6   2.0
3  2001  Nevada  2.4   3.0
4  2002  Nevada  2.9   4.0
5  2003  Nevada  3.2   5.0

In [63]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [64]:
frame2['year']

0    2000
1    2001
2    2002
3    2001
4    2002
5    2003
Name: year, dtype: int64

In [65]:
frame2.year

0    2000
1    2001
2    2002
3    2001
4    2002
5    2003
Name: year, dtype: int64

In [68]:
frame2.loc[1]

year     2001
state    Ohio
pop       1.7
debt      NaN
Name: 1, dtype: object

In [69]:
frame2.debt=16.5

In [71]:
frame2.debt=np.arange(6.)

In [77]:
val = pd.Series([-1.2,-1.5,-1.7], index=[2,4,5])

In [78]:
val

2   -1.2
4   -1.5
5   -1.7
dtype: float64

In [79]:
frame2.debt=val

In [87]:
frame2

   year   state  pop  debt
0  2000    Ohio  1.5   NaN
1  2001    Ohio  1.7   NaN
2  2002    Ohio  3.6  -1.2
3  2001  Nevada  2.4   NaN
4  2002  Nevada  2.9  -1.5
5  2003  Nevada  3.2  -1.7

In [83]:
frame2['easten']=frame2.state == 'Ohio'

In [86]:
del frame2['easten']

In [88]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [93]:
pop={
    'Nevada':{2001:2.4,2002:2.9},
    'Ohio':{2000:1.5, 2001:1.7, 2002:3.6}
}

In [94]:
pop

{'Nevada': {2001: 2.4, 2002: 2.9}, 'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}

In [95]:
frame3=pd.DataFrame(pop)

In [96]:
frame3

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

In [97]:
frame3.T

        2000  2001  2002
Nevada   NaN   2.4   2.9
Ohio     1.5   1.7   3.6

In [98]:
pd.DataFrame(pop, index=[2001,2002,2003])

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2003     NaN   NaN

In [103]:
frame3['Ohio'][:2]

2000    1.5
2001    1.7
Name: Ohio, dtype: float64

In [104]:
pdata={
    'Ohio':frame3['Ohio'][:-1],
    'Nevada':frame3['Nevada'][:2]
}

In [105]:
pd.DataFrame(pdata)

      Ohio  Nevada
2000   1.5     NaN
2001   1.7     2.4

In [106]:
obj = pd.Series([4.5,7.2,-5.3,3.6], index=['d','b','a','c'])

In [107]:
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [108]:
obj2=obj.reindex(['a','b','c','d','e'])

In [109]:
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [110]:
obj3=pd.Series(['blue','purple','yellow'], index=[0,2,4])

In [111]:
obj3

0      blue
2    purple
4    yellow
dtype: object

ffill实现向前填充

In [112]:
obj3.reindex(range(6), method='ffill')

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [132]:
frame=pd.DataFrame(np.arange(9).reshape(3,3), index=['a','c','d'], columns=['Ohio','Texas','California'])

In [125]:
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [115]:
frame2=frame.reindex(['a','b','c','d'])

In [116]:
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [119]:
states=['Texas','Utah','California']

In [120]:
frame.reindex(columns=states)

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

In [121]:
a=frame.copy()

In [122]:
a

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [128]:
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [127]:
frame.drop('a')

   Ohio  Texas  California
c     3      4           5
d     6      7           8

In [129]:
frame.drop('Ohio',axis=1)

   Texas  California
a      1           2
c      4           5
d      7           8

In [130]:
frame.drop('Ohio',axis=1, inplace=True)

In [131]:
frame

   Texas  California
a      1           2
c      4           5
d      7           8

In [133]:
data=pd.DataFrame(np.arange(9).reshape(3,3), index=['a','c','d'], columns=['Ohio','Texas','California'])

In [142]:
data

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

# 索引获得列

In [137]:
data['Ohio']

a    0
c    3
d    6
Name: Ohio, dtype: int32

切片得行

In [141]:
data[2:3]

   Ohio  Texas  California
d     6      7           8

In [143]:
data[2:3]>7

    Ohio  Texas  California
d  False  False        True

In [145]:
data[data[2:3]>3]

   Ohio  Texas  California
a   NaN    NaN         NaN
c   NaN    NaN         NaN
d   6.0    7.0         8.0

In [146]:
data['Ohio']>2

a    False
c     True
d     True
Name: Ohio, dtype: bool

In [147]:
data[data['Ohio']>2]

   Ohio  Texas  California
c     3      4           5
d     6      7           8

In [148]:
data[1:2]['Ohio']

c    3
Name: Ohio, dtype: int32

In [149]:
data

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [150]:
data.loc['a',['Texas','California']]

Texas         1
California    2
Name: a, dtype: int32

In [152]:
data.iloc[2,[2,0,1]]

California    8
Ohio          6
Texas         7
Name: d, dtype: int32

In [153]:
data.iloc[2]

Ohio          6
Texas         7
California    8
Name: d, dtype: int32

In [154]:
data.iloc[[1,2],[2,0,1]]

   California  Ohio  Texas
c           5     3      4
d           8     6      7

In [155]:
data

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [156]:
data.loc[:'c','Ohio']

a    0
c    3
Name: Ohio, dtype: int32

In [163]:
data.iloc[:, :2]

   Ohio  Texas
a     0      1
c     3      4
d     6      7

In [165]:
data.Ohio>3

a    False
c    False
d     True
Name: Ohio, dtype: bool

In [166]:
data.iloc[:, :2][data.Ohio>3]

   Ohio  Texas
d     6      7

In [182]:
ser1=pd.Series(np.arange(3.))

In [183]:
ser1

0    0.0
1    1.0
2    2.0
dtype: float64

In [184]:
ser1[-1]

KeyError: -1

In [177]:
ser.index=(['a','b','c'])

In [179]:
ser

a    0.0
b    1.0
c    2.0
dtype: float64

In [185]:
df1=pd.DataFrame(np.arange(12.).reshape(3,4),columns=list('abcd'))

In [186]:
df2=pd.DataFrame(np.arange(20.).reshape(4,5),columns=list('abcde'))

In [187]:
df1

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [200]:
1/df1

       a         b         c         d
0    inf  1.000000  0.500000  0.333333
1  0.250  0.200000  0.166667  0.142857
2  0.125  0.111111  0.100000  0.090909

In [190]:
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   NaN   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [189]:
df2.loc[1,'b']=np.nan

In [196]:
d=pd.DataFrame(np.zeros(4).reshape(1,4),columns=list('abcd'))

In [197]:
d

     a    b    c    d
0  0.0  0.0  0.0  0.0

In [198]:
df1+df2

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0   NaN  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [199]:
df1.add(df2, fill_value=0)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0   5.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [201]:
frame=pd.DataFrame(np.random.randn(4,3), columns=list('bde'), index=['Utah','Ohio','Texas','Oregon'])

In [202]:
frame

               b         d         e
Utah   -0.564127  1.065269 -0.848406
Ohio    2.692447  1.085899  0.851647
Texas  -0.678932 -0.164598  1.170462
Oregon  1.334932 -1.966776 -0.406268

In [203]:
f=lambda x: x.max()-x.min()

In [204]:
frame.apply(f)

b    3.371379
d    3.052675
e    2.018868
dtype: float64

In [205]:
frame.apply(f,axis=0)

b    3.371379
d    3.052675
e    2.018868
dtype: float64

In [206]:
frame.apply(f,axis=1)

Utah      1.913675
Ohio      1.840800
Texas     1.849394
Oregon    3.301709
dtype: float64

In [207]:
def f(x):
    return pd.Series([x.max(), x.min()], index=['max','min'])

In [208]:
frame

               b         d         e
Utah   -0.564127  1.065269 -0.848406
Ohio    2.692447  1.085899  0.851647
Texas  -0.678932 -0.164598  1.170462
Oregon  1.334932 -1.966776 -0.406268

In [209]:
frame.apply(f)

            b         d         e
max  2.692447  1.085899  1.170462
min -0.678932 -1.966776 -0.848406

In [211]:
format=lambda x:'%.2f'%x

In [212]:
frame.applymap(format)

            b      d      e
Utah    -0.56   1.07  -0.85
Ohio     2.69   1.09   0.85
Texas   -0.68  -0.16   1.17
Oregon   1.33  -1.97  -0.41

In [214]:
frame['e'].map(format)

Utah      -0.85
Ohio       0.85
Texas      1.17
Oregon    -0.41
Name: e, dtype: object

In [215]:
obj=pd.Series(np.arange(4), index=list('adbc'))

In [216]:
obj

a    0
d    1
b    2
c    3
dtype: int32

In [217]:
obj.sort_index()

a    0
b    2
c    3
d    1
dtype: int32

In [218]:
obj=pd.Series([7,-5,7,4,2,0,4])

In [219]:
obj.rank()

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

In [225]:
obj.rank(method='first')

0    6.0
1    1.0
2    7.0
3    4.0
4    3.0
5    2.0
6    5.0
dtype: float64

In [226]:
obj.rank(method='max')

0    7.0
1    1.0
2    7.0
3    5.0
4    3.0
5    2.0
6    5.0
dtype: float64

In [228]:
obj.rank(method='first', ascending=False)

0    1.0
1    7.0
2    2.0
3    3.0
4    5.0
5    6.0
6    4.0
dtype: float64

In [229]:
frame

               b         d         e
Utah   -0.564127  1.065269 -0.848406
Ohio    2.692447  1.085899  0.851647
Texas  -0.678932 -0.164598  1.170462
Oregon  1.334932 -1.966776 -0.406268

In [230]:
frame.rank(axis=0)

          b    d    e
Utah    2.0  3.0  1.0
Ohio    4.0  4.0  3.0
Texas   1.0  2.0  4.0
Oregon  3.0  1.0  2.0

In [231]:
frame.rank(axis='index')

          b    d    e
Utah    2.0  3.0  1.0
Ohio    4.0  4.0  3.0
Texas   1.0  2.0  4.0
Oregon  3.0  1.0  2.0

In [232]:
frame.rank(axis=1)

          b    d    e
Utah    2.0  3.0  1.0
Ohio    3.0  2.0  1.0
Texas   1.0  2.0  3.0
Oregon  3.0  1.0  2.0

In [234]:
df=pd.DataFrame(np.random.randn(4,3), index=['a','a','b','b'])

In [235]:
df

          0         1         2
a -1.100515 -0.257848 -0.810071
a -0.315277  0.213468  0.413372
b  1.042475  0.746703  1.026971
b  2.167739 -0.327686  1.938016

In [236]:
df.loc['a']

          0         1         2
a -1.100515 -0.257848 -0.810071
a -0.315277  0.213468  0.413372

In [240]:
df.loc[:,1]

a   -0.257848
a    0.213468
b    0.746703
b   -0.327686
Name: 1, dtype: float64

In [241]:
df

          0         1         2
a -1.100515 -0.257848 -0.810071
a -0.315277  0.213468  0.413372
b  1.042475  0.746703  1.026971
b  2.167739 -0.327686  1.938016

In [242]:
df.max()

0    2.167739
1    0.746703
2    1.938016
dtype: float64

In [243]:
df.idxmax()

0    b
1    b
2    b
dtype: object

In [244]:
df.cumsum()

          0         1         2
a -1.100515 -0.257848 -0.810071
a -1.415792 -0.044380 -0.396698
b -0.373317  0.702322  0.630273
b  1.794421  0.374637  2.568289

In [245]:
df.cumsum(axis=1)

          0         1         2
a -1.100515 -1.358363 -2.168434
a -0.315277 -0.101809  0.311563
b  1.042475  1.789178  2.816149
b  2.167739  1.840053  3.778069

In [247]:
df

          0         1         2
a -1.100515 -0.257848 -0.810071
a -0.315277  0.213468  0.413372
b  1.042475  0.746703  1.026971
b  2.167739 -0.327686  1.938016

In [246]:
df.describe()

              0         1         2
count  4.000000  4.000000  4.000000
mean   0.448605  0.093659  0.642072
std    1.448147  0.497296  1.153060
min   -1.100515 -0.327686 -0.810071
25%   -0.511587 -0.275308  0.107512
50%    0.363599 -0.022190  0.720172
75%    1.323791  0.346777  1.254732
max    2.167739  0.746703  1.938016

In [249]:
import pandas_datareader.data as web

In [250]:
all_data={ticker:web.get_data_yahoo(ticker) for ticker in (['AAPL','IBM','MSFT','GOOD'])}

In [251]:
all_data

{'AAPL':                   High         Low        Open       Close       Volume  \
 Date
 2009-12-31   30.478571   30.080000   30.447144   30.104286   88102700.0
 2010-01-04   30.642857   30.340000   30.490000   30.572857  123432400.0
 2010-01-05   30.798571   30.464285   30.657143   30.625713  150476200.0
 2010-01-06   30.747143   30.107143   30.625713   30.138571  138040000.0
 2010-01-07   30.285715   29.864286   30.250000   30.082857  119282800.0
 2010-01-08   30.285715   29.865715   30.042856   30.282858  111902700.0
 2010-01-11   30.428572   29.778572   30.400000   30.015715  115557400.0
 2010-01-12   29.967142   29.488571   29.884285   29.674286  148614900.0
 2010-01-13   30.132856   29.157143   29.695715   30.092857  151473000.0
 2010-01-14   30.065714   29.860001   30.015715   29.918571  108223500.0
 2010-01-15   30.228571   29.410000   30.132856   29.418571  148516900.0
 2010-01-19   30.741428   29.605715   29.761429   30.719999  182501900.0
 2010-01-20   30.792856   29.928572   30.701429   30.247143  153038200.0
 2010-01-21   30.472857   29.601429   30.297142   29.724285  152038600.0
 2010-01-22   29.642857   28.165714   29.540001   28.250000  220441900.0
 2010-01-25   29.242857   28.598572   28.930000   29.010000  266424900.0
 2010-01-26   30.530001   28.940001   29.421429   29.420000  466777500.0
 2010-01-27   30.082857   28.504286   29.549999   29.697144  430642100.0
 2010-01-28   29.357143   28.385714   29.275715   28.469999  293375600.0
 2010-01-29   28.885714   27.178572   28.725714   27.437143  311488100.0
 2010-02-01   28.000000   27.328571   27.481428   27.818571  187469100.0
 2010-02-02   28.045713   27.625713   27.987143   27.980000  174585600.0
 2010-02-03   28.600000   27.774286   27.881428   28.461428  153832000.0
 2010-02-04   28.338572   27.367144   28.104286   27.435715  189413000.0
 2010-02-05   28.000000   27.264286   27.518572   27.922857  212576700.0
 2010-02-08   28.268572   27.714285   27.955715   27.731428  119567700.0
 2010-02-09   28.214285   27.821428   28.059999   28.027143  158221700.0
 2010-02-10   28.085714   27.751429   27.984285   27.874287   92590400.0
 2010-02-11   28.535715   27.722857   27.840000   28.381428  137586400.0
 2010-02-12   28.805714   27.928572   28.301428   28.625713  163867200.0
 ...                ...         ...         ...         ...          ...
 2019-06-21  200.850006  198.149994  198.800003  198.779999   47800600.0
 2019-06-24  200.160004  198.169998  198.539993  198.580002   18220400.0
 2019-06-25  199.259995  195.289993  198.429993  195.570007   21070300.0
 2019-06-26  200.990005  197.350006  197.770004  199.800003   26067500.0
 2019-06-27  201.570007  199.570007  200.289993  199.740005   20899700.0
 2019-06-28  199.500000  197.050003  198.679993  197.919998   31110600.0
 2019-07-01  204.490005  200.649994  203.169998  201.550003   27316700.0
 2019-07-02  203.130005  201.360001  201.410004  202.729996   16935200.0
 2019-07-03  204.440002  202.690002  203.279999  204.410004   11362000.0
 2019-07-05  205.080002  202.899994  203.350006  204.229996   17265500.0
 2019-07-08  201.399994  198.410004  200.809998  200.020004   25338600.0
 2019-07-09  201.509995  198.809998  199.199997  201.240005   20578000.0
 2019-07-10  203.729996  201.559998  201.850006  203.229996   17897100.0
 2019-07-11  204.389999  201.710007  203.309998  201.750000   20191800.0
 2019-07-12  204.000000  202.199997  202.449997  203.300003   17595200.0
 2019-07-15  205.869995  204.000000  204.089996  205.210007   16947400.0
 2019-07-16  206.110001  203.500000  204.589996  204.500000   16866800.0
 2019-07-17  205.089996  203.270004  204.050003  203.350006   14107500.0
 2019-07-18  205.880005  203.699997  204.000000  205.660004   18582200.0
 2019-07-19  206.500000  202.360001  205.789993  202.589996   20929300.0
 2019-07-22  207.229996  203.610001  203.649994  207.220001   22277900.0
 2019-07-23  208.910004  207.289993  208.460007  208.839996   18355200.0
 2019-07-24  209.149994  207.169998  207.669998  208.669998   14991600.0
 2019-07-25  209.240005  206.729996  208.889999  207.020004   13909600.0
 2019-07-26  209.729996  207.139999  207.479996  207.740005   17618900.0
 2019-07-29  210.639999  208.440002  208.460007  209.679993   21673400.0
 2019-07-30  210.160004  207.309998  208.759995  208.779999   33935700.0
 2019-07-31  221.369995  211.300003  216.419998  213.039993   69281400.0
 2019-08-01  218.029999  206.740005  213.899994  208.429993   54017900.0
 2019-08-02  206.429993  201.630005  205.529999  204.020004   38688200.0

              Adj Close
 Date
 2009-12-31   26.372231
 2010-01-04   26.782711
 2010-01-05   26.829010
 2010-01-06   26.402260
 2010-01-07   26.353460
 2010-01-08   26.528664
 2010-01-11   26.294640
 2010-01-12   25.995537
 2010-01-13   26.362217
 2010-01-14   26.209538
 2010-01-15   25.771528
 2010-01-19   26.911612
 2010-01-20   26.497383
 2010-01-21   26.039341
 2010-01-22   24.747818
 2010-01-25   25.413599
 2010-01-26   25.772774
 2010-01-27   26.015560
 2010-01-28   24.940546
 2010-01-29   24.035734
 2010-02-01   24.369871
 2010-02-02   24.511295
 2010-02-03   24.933033
 2010-02-04   24.034487
 2010-02-05   24.461227
 2010-02-08   24.293537
 2010-02-09   24.552589
 2010-02-10   24.418684
 2010-02-11   24.862957
 2010-02-12   25.076958
 ...                ...
 2019-06-21  198.779999
 2019-06-24  198.580002
 2019-06-25  195.570007
 2019-06-26  199.800003
 2019-06-27  199.740005
 2019-06-28  197.919998
 2019-07-01  201.550003
 2019-07-02  202.729996
 2019-07-03  204.410004
 2019-07-05  204.229996
 2019-07-08  200.020004
 2019-07-09  201.240005
 2019-07-10  203.229996
 2019-07-11  201.750000
 2019-07-12  203.300003
 2019-07-15  205.210007
 2019-07-16  204.500000
 2019-07-17  203.350006
 2019-07-18  205.660004
 2019-07-19  202.589996
 2019-07-22  207.220001
 2019-07-23  208.839996
 2019-07-24  208.669998
 2019-07-25  207.020004
 2019-07-26  207.740005
 2019-07-29  209.679993
 2019-07-30  208.779999
 2019-07-31  213.039993
 2019-08-01  208.429993
 2019-08-02  204.020004

 [2413 rows x 6 columns],
 'IBM':                   High         Low        Open       Close      Volume  \
 Date
 2009-12-31  132.850006  130.750000  132.410004  130.899994   4223400.0
 2010-01-04  132.970001  130.850006  131.179993  132.449997   6155300.0
 2010-01-05  131.850006  130.100006  131.679993  130.850006   6841400.0
 2010-01-06  131.490005  129.809998  130.679993  130.000000   5605300.0
 2010-01-07  130.250000  128.910004  129.869995  129.550003   5840600.0
 2010-01-08  130.919998  129.050003  129.070007  130.850006   4197200.0
 2010-01-11  131.059998  128.669998  131.059998  129.479996   5730400.0
 2010-01-12  131.330002  129.000000  129.029999  130.509995   8081500.0
 2010-01-13  131.119995  129.160004  130.389999  130.229996   6455400.0
 2010-01-14  132.710007  129.910004  130.550003  132.309998   7111800.0
 2010-01-15  132.889999  131.089996  132.029999  131.779999   8494400.0
 2010-01-19  134.250000  131.559998  131.630005  134.139999  13916200.0
 2010-01-20  131.149994  128.949997  130.460007  130.250000  15197500.0
 2010-01-21  130.690002  128.059998  130.470001  129.000000   9608600.0
 2010-01-22  128.889999  125.370003  128.669998  125.500000  10088600.0
 2010-01-25  126.889999  125.709999  126.330002  126.120003   5738500.0
 2010-01-26  127.750000  125.410004  125.919998  125.750000   7135300.0
 2010-01-27  126.959999  125.040001  125.820000  126.330002   8719200.0
 2010-01-28  127.040001  123.050003  127.029999  123.750000   9622200.0
 2010-01-29  125.000000  121.900002  124.320000  122.389999  11571200.0
 2010-02-01  124.949997  122.779999  123.230003  124.669998   7242900.0
 2010-02-02  125.809998  123.949997  124.790001  125.529999   5899900.0
 2010-02-03  126.070000  125.070000  125.160004  125.660004   4177100.0
 2010-02-04  125.440002  122.900002  125.190002  123.000000   9126900.0
 2010-02-05  123.720001  121.830002  123.040001  123.519997   8617000.0
 2010-02-08  123.220001  121.739998  123.150002  121.879997   5718500.0
 2010-02-09  124.199997  122.459999  122.650002  123.209999   6044500.0
 2010-02-10  123.650002  122.209999  122.940002  122.809998   5219100.0
 2010-02-11  124.199997  122.059998  122.580002  123.730003   5089000.0
 2010-02-12  124.050003  121.610001  123.010002  124.000000   8017700.0
 ...                ...         ...         ...         ...         ...
 2019-06-21  139.539993  138.389999  138.440002  139.199997   5288700.0
 2019-06-24  140.149994  139.050003  139.199997  139.350006   2186000.0
 2019-06-25  139.550003  138.130005  139.460007  138.360001   2801200.0
 2019-06-26  139.679993  138.410004  138.869995  138.520004   2284600.0
 2019-06-27  139.300003  137.949997  138.720001  138.520004   2149800.0
 2019-06-28  139.139999  137.839996  138.570007  137.899994   6153900.0
 2019-07-01  141.490005  139.279999  139.600006  139.880005   3377700.0
 2019-07-02  140.429993  139.470001  139.750000  140.220001   2409700.0
 2019-07-03  141.820007  140.429993  140.720001  141.539993   1930400.0
 2019-07-05  141.490005  139.910004  140.869995  141.380005   2134700.0
 2019-07-08  141.289993  140.270004  141.050003  140.570007   2395300.0
 2019-07-09  140.990005  139.130005  140.610001  139.330002   3365200.0
 2019-07-10  141.910004  139.789993  140.000000  140.470001   2513900.0
 2019-07-11  141.580002  140.300003  140.789993  141.240005   2132900.0
 2019-07-12  142.919998  141.660004  141.919998  142.740005   2786200.0
 2019-07-15  143.509995  142.119995  142.889999  143.320007   2368300.0
 2019-07-16  144.039993  143.020004  143.169998  143.529999   3474700.0
 2019-07-17  143.800003  141.949997  143.610001  143.070007   6064300.0
 2019-07-18  150.309998  142.199997  142.500000  149.630005  12695400.0
 2019-07-19  151.580002  149.550003  149.960007  149.679993   7290700.0
 2019-07-22  151.940002  149.699997  150.160004  149.740005   4092600.0
 2019-07-23  150.720001  148.380005  150.570007  150.380005   3742200.0
 2019-07-24  151.449997  149.199997  150.119995  150.029999   2952400.0
 2019-07-25  150.619995  148.610001  149.820007  150.389999   3102100.0
 2019-07-26  151.410004  150.100006  151.000000  151.360001   2904300.0
 2019-07-29  151.479996  150.320007  151.110001  150.880005   2075500.0
 2019-07-30  150.399994  149.220001  150.000000  149.770004   2632700.0
 2019-07-31  150.179993  146.389999  149.699997  148.240005   3722900.0
 2019-08-01  152.820007  148.500000  148.899994  150.320007   6344000.0
 2019-08-02  152.949997  145.589996  149.029999  147.250000   8080100.0

              Adj Close
 Date
 2009-12-31   98.137283
 2010-01-04   99.299347
 2010-01-05   98.099792
 2010-01-06   97.462532
 2010-01-07   97.125160
 2010-01-08   98.099792
 2010-01-11   97.072685
 2010-01-12   97.844872
 2010-01-13   97.634964
 2010-01-14   99.194389
 2010-01-15   98.797028
 2010-01-19  100.566330
 2010-01-20   97.649979
 2010-01-21   96.712860
 2010-01-22   94.088844
 2010-01-25   94.553688
 2010-01-26   94.276276
 2010-01-27   94.711105
 2010-01-28   92.776848
 2010-01-29   91.757233
 2010-02-01   93.466576
 2010-02-02   94.111336
 2010-02-03   94.208817
 2010-02-04   92.214569
 2010-02-05   92.604401
 2010-02-08   91.783577
 2010-02-09   92.785126
 2010-02-10   92.483902
 2010-02-11   93.176750
 2010-02-12   93.380051
 ...                ...
 2019-06-21  139.199997
 2019-06-24  139.350006
 2019-06-25  138.360001
 2019-06-26  138.520004
 2019-06-27  138.520004
 2019-06-28  137.899994
 2019-07-01  139.880005
 2019-07-02  140.220001
 2019-07-03  141.539993
 2019-07-05  141.380005
 2019-07-08  140.570007
 2019-07-09  139.330002
 2019-07-10  140.470001
 2019-07-11  141.240005
 2019-07-12  142.740005
 2019-07-15  143.320007
 2019-07-16  143.529999
 2019-07-17  143.070007
 2019-07-18  149.630005
 2019-07-19  149.679993
 2019-07-22  149.740005
 2019-07-23  150.380005
 2019-07-24  150.029999
 2019-07-25  150.389999
 2019-07-26  151.360001
 2019-07-29  150.880005
 2019-07-30  149.770004
 2019-07-31  148.240005
 2019-08-01  150.320007
 2019-08-02  147.250000

 [2413 rows x 6 columns],
 'MSFT':                   High         Low        Open       Close       Volume  \
 Date
 2009-12-31   30.990000   30.480000   30.980000   30.480000   31929700.0
 2010-01-04   31.100000   30.590000   30.620001   30.950001   38409100.0
 2010-01-05   31.100000   30.639999   30.850000   30.959999   49749600.0
 2010-01-06   31.080000   30.520000   30.879999   30.770000   58182400.0
 2010-01-07   30.700001   30.190001   30.629999   30.450001   50559700.0
 2010-01-08   30.879999   30.240000   30.280001   30.660000   51197400.0
 2010-01-11   30.760000   30.120001   30.709999   30.270000   68754700.0
 2010-01-12   30.400000   29.910000   30.150000   30.070000   65912100.0
 2010-01-13   30.520000   30.010000   30.260000   30.350000   51863500.0
 2010-01-14   31.100000   30.260000   30.309999   30.959999   63228100.0
 2010-01-15   31.240000   30.709999   31.080000   30.860001   79913200.0
 2010-01-19   31.240000   30.680000   30.750000   31.100000   46575700.0
 2010-01-20   30.940001   30.309999   30.809999   30.590000   54849500.0
 2010-01-21   30.719999   30.000000   30.610001   30.010000   73086700.0
 2010-01-22   30.200001   28.840000   30.000000   28.959999  102004600.0
 2010-01-25   29.660000   29.100000   29.240000   29.320000   63373000.0
 2010-01-26   29.850000   29.090000   29.200001   29.500000   66639900.0
 2010-01-27   29.820000   29.020000   29.350000   29.670000   63949500.0
 2010-01-28   29.870001   28.889999   29.840000   29.160000  117513700.0
 2010-01-29   29.920000   27.660000   29.900000   28.180000  193888500.0
 2010-02-01   28.480000   27.920000   28.389999   28.410000   85931100.0
 2010-02-02   28.500000   28.139999   28.370001   28.459999   54413700.0
 2010-02-03   28.790001   28.120001   28.260000   28.629999   61397900.0
 2010-02-04   28.500000   27.809999   28.379999   27.840000   77850000.0
 2010-02-05   28.280001   27.570000   28.000000   28.020000   80960100.0
 2010-02-08   28.080000   27.570000   28.010000   27.719999   52820600.0
 2010-02-09   28.340000   27.750000   27.969999   28.010000   59195800.0
 2010-02-10   28.240000   27.840000   28.030001   27.990000   48591300.0
 2010-02-11   28.400000   27.700001   27.930000   28.120001   65993700.0
 2010-02-12   28.059999   27.580000   27.809999   27.930000   81117200.0
 ...                ...         ...         ...         ...          ...
 2019-06-21  137.729996  136.460007  136.580002  136.970001   36727900.0
 2019-06-24  138.399994  137.000000  137.000000  137.779999   20628800.0
 2019-06-25  137.589996  132.729996  137.250000  133.429993   33327400.0
 2019-06-26  135.740005  133.600006  134.350006  133.929993   23657700.0
 2019-06-27  134.710007  133.509995  134.139999  134.149994   16557500.0
 2019-06-28  134.600006  133.160004  134.570007  133.960007   30043000.0
 2019-07-01  136.699997  134.970001  136.630005  135.679993   22654200.0
 2019-07-02  136.589996  135.339996  136.119995  136.580002   15237800.0
 2019-07-03  137.740005  136.289993  136.800003  137.460007   13629300.0
 2019-07-05  137.330002  135.720001  135.940002  137.059998   18141100.0
 2019-07-08  137.100006  135.369995  136.399994  136.960007   16779700.0
 2019-07-09  136.970001  135.800003  136.000000  136.460007   19953100.0
 2019-07-10  138.580002  137.020004  137.130005  137.850006   24204400.0
 2019-07-11  139.220001  137.869995  138.199997  138.399994   22327900.0
 2019-07-12  139.130005  138.009995  138.850006  138.899994   18936800.0
 2019-07-15  139.539993  138.460007  139.440002  138.899994   16651500.0
 2019-07-16  139.050003  136.520004  138.960007  137.080002   22726100.0
 2019-07-17  137.929993  136.220001  137.699997  136.270004   20211000.0
 2019-07-18  136.619995  134.669998  135.550003  136.419998   30808700.0
 2019-07-19  140.669998  136.449997  140.220001  136.619995   48992400.0
 2019-07-22  139.190002  137.330002  137.410004  138.429993   25074900.0
 2019-07-23  139.990005  138.029999  139.759995  139.289993   18034600.0
 2019-07-24  140.740005  138.850006  138.899994  140.720001   20738300.0
 2019-07-25  140.610001  139.320007  140.429993  140.190002   18356900.0
 2019-07-26  141.679993  140.300003  140.369995  141.339996   19037600.0
 2019-07-29  141.509995  139.369995  141.500000  141.029999   16605900.0
 2019-07-30  141.220001  139.800003  140.139999  140.350006   16846500.0
 2019-07-31  140.490005  135.080002  140.330002  136.270004   38598800.0
 2019-08-01  140.940002  136.929993  137.000000  138.059998   40557500.0
 2019-08-02  138.320007  135.259995  138.089996  136.899994   30199700.0

              Adj Close
 Date
 2009-12-31   24.152580
 2010-01-04   24.525019
 2010-01-05   24.532942
 2010-01-06   24.382378
 2010-01-07   24.128809
 2010-01-08   24.295214
 2010-01-11   23.986179
 2010-01-12   23.827694
 2010-01-13   24.049570
 2010-01-14   24.532942
 2010-01-15   24.453693
 2010-01-19   24.643881
 2010-01-20   24.239746
 2010-01-21   23.780155
 2010-01-22   22.948128
 2010-01-25   23.233395
 2010-01-26   23.376024
 2010-01-27   23.510740
 2010-01-28   23.106604
 2010-01-29   22.330048
 2010-02-01   22.512297
 2010-02-02   22.551926
 2010-02-03   22.686628
 2010-02-04   22.060629
 2010-02-05   22.203266
 2010-02-08   21.965540
 2010-02-09   22.195339
 2010-02-10   22.179491
 2010-02-11   22.282507
 2010-02-12   22.131947
 ...                ...
 2019-06-21  136.970001
 2019-06-24  137.779999
 2019-06-25  133.429993
 2019-06-26  133.929993
 2019-06-27  134.149994
 2019-06-28  133.960007
 2019-07-01  135.679993
 2019-07-02  136.580002
 2019-07-03  137.460007
 2019-07-05  137.059998
 2019-07-08  136.960007
 2019-07-09  136.460007
 2019-07-10  137.850006
 2019-07-11  138.399994
 2019-07-12  138.899994
 2019-07-15  138.899994
 2019-07-16  137.080002
 2019-07-17  136.270004
 2019-07-18  136.419998
 2019-07-19  136.619995
 2019-07-22  138.429993
 2019-07-23  139.289993
 2019-07-24  140.720001
 2019-07-25  140.190002
 2019-07-26  141.339996
 2019-07-29  141.029999
 2019-07-30  140.350006
 2019-07-31  136.270004
 2019-08-01  138.059998
 2019-08-02  136.899994

 [2413 rows x 6 columns],
 'GOOD':                  High        Low       Open      Close    Volume  Adj Close
 Date
 2009-12-31  13.600000  13.100000  13.360000  13.410000   45300.0   6.023040
 2010-01-04  13.660000  13.120000  13.560000  13.480000   30600.0   6.054482
 2010-01-05  13.650000  13.050000  13.470000  13.050000   46100.0   5.861350
 2010-01-06  13.470000  13.080000  13.080000  13.220000   26100.0   5.937706
 2010-01-07  13.400000  13.140000  13.220000  13.240000   14400.0   5.946688
 2010-01-08  13.480000  13.200000  13.310000  13.480000   21000.0   6.054482
 2010-01-11  13.490000  13.300000  13.490000  13.310000    9700.0   5.978127
 2010-01-12  13.540000  13.300000  13.300000  13.420000   21800.0   6.027536
 2010-01-13  13.550000  13.350000  13.480000  13.380000   29300.0   6.009570
 2010-01-14  13.650000  13.380000  13.390000  13.580000   22400.0   6.099397
 2010-01-15  13.650000  13.420000  13.650000  13.520000   54400.0   6.072449
 2010-01-19  13.790000  13.100000  13.550000  13.490000   81700.0   6.115519
 2010-01-20  13.490000  13.260000  13.470000  13.340000   25900.0   6.047517
 2010-01-21  13.450000  13.150000  13.250000  13.150000   36800.0   5.961383
 2010-01-22  13.550000  13.050000  13.180000  13.380000   56600.0   6.065650
 2010-01-25  13.560000  13.060000  13.510000  13.230000   25400.0   5.997648
 2010-01-26  13.680000  13.240000  13.240000  13.350000   37800.0   6.052046
 2010-01-27  13.900000  13.250000  13.260000  13.480000   39800.0   6.110980
 2010-01-28  13.900000  13.540000  13.560000  13.840000   36400.0   6.274182
 2010-01-29  14.230000  13.750000  14.000000  13.920000   83700.0   6.310451
 2010-02-01  14.190000  13.890000  13.920000  13.900000   31200.0   6.301385
 2010-02-02  14.030000  13.870000  13.910000  13.870000   33600.0   6.287784
 2010-02-03  14.100000  13.870000  13.890000  13.970000   46300.0   6.333118

In [252]:
price=pd.DataFrame({ticker:data['Adj Close'] for ticker, data in all_data.items()})

In [253]:
price

                  AAPL         IBM        MSFT       GOOD
Date
2009-12-31   26.372231   98.137283   24.152580   6.023040
2010-01-04   26.782711   99.299347   24.525019   6.054482
2010-01-05   26.829010   98.099792   24.532942   5.861350
2010-01-06   26.402260   97.462532   24.382378   5.937706
2010-01-07   26.353460   97.125160   24.128809   5.946688
2010-01-08   26.528664   98.099792   24.295214   6.054482
2010-01-11   26.294640   97.072685   23.986179   5.978127
2010-01-12   25.995537   97.844872   23.827694   6.027536
2010-01-13   26.362217   97.634964   24.049570   6.009570
2010-01-14   26.209538   99.194389   24.532942   6.099397
2010-01-15   25.771528   98.797028   24.453693   6.072449
2010-01-19   26.911612  100.566330   24.643881   6.115519
2010-01-20   26.497383   97.649979   24.239746   6.047517
2010-01-21   26.039341   96.712860   23.780155   5.961383
2010-01-22   24.747818   94.088844   22.948128   6.065650
2010-01-25   25.413599   94.553688   23.233395   5.997648
2010-01-26   25.772774   94.276276   23.376024   6.052046
2010-01-27   26.015560   94.711105   23.510740   6.110980
2010-01-28   24.940546   92.776848   23.106604   6.274182
2010-01-29   24.035734   91.757233   22.330048   6.310451
2010-02-01   24.369871   93.466576   22.512297   6.301385
2010-02-02   24.511295   94.111336   22.551926   6.287784
2010-02-03   24.933033   94.208817   22.686628   6.333118
2010-02-04   24.034487   92.214569   22.060629   6.233386
2010-02-05   24.461227   92.604401   22.203266   6.378454
2010-02-08   24.293537   91.783577   21.965540   6.265118
2010-02-09   24.552589   92.785126   22.195339   6.283251
2010-02-10   24.418684   92.483902   22.179491   6.364853
2010-02-11   24.862957   93.176750   22.282507   6.346717
2010-02-12   25.076958   93.380051   22.131947   6.346717
...                ...         ...         ...        ...
2019-06-21  198.779999  139.199997  136.970001  21.354708
2019-06-24  198.580002  139.350006  137.779999  21.324884
2019-06-25  195.570007  138.360001  133.429993  20.937157
2019-06-26  199.800003  138.520004  133.929993  20.569317
2019-06-27  199.740005  138.520004  134.149994  20.768148
2019-06-28  197.919998  137.899994  133.960007  21.096224
2019-07-01  201.550003  139.880005  135.679993  21.155874
2019-07-02  202.729996  140.220001  136.580002  21.444183
2019-07-03  204.410004  141.539993  137.460007  21.672840
2019-07-05  204.229996  141.380005  137.059998  21.533657
2019-07-08  200.020004  140.570007  136.960007  21.503832
2019-07-09  201.240005  139.330002  136.460007  21.533657
2019-07-10  203.229996  140.470001  137.850006  21.503832
2019-07-11  201.750000  141.240005  138.399994  21.275173
2019-07-12  203.300003  142.740005  138.899994  21.265232
2019-07-15  205.210007  143.320007  138.899994  21.255291
2019-07-16  204.500000  143.529999  137.080002  21.255291
2019-07-17  203.350006  143.070007  136.270004  21.205584
2019-07-18  205.660004  149.630005  136.419998  21.305000
2019-07-19  202.589996  149.679993  136.619995  21.000000
2019-07-22  207.220001  149.740005  138.429993  20.969999
2019-07-23  208.839996  150.380005  139.289993  21.150000
2019-07-24  208.669998  150.029999  140.720001  21.290001
2019-07-25  207.020004  150.389999  140.190002  21.100000
2019-07-26  207.740005  151.360001  141.339996  21.160000
2019-07-29  209.679993  150.880005  141.029999  21.420000
2019-07-30  208.779999  149.770004  140.350006  21.360001
2019-07-31  213.039993  148.240005  136.270004  21.260000
2019-08-01  208.429993  150.320007  138.059998  21.350000
2019-08-02  204.020004  147.250000  136.899994  21.309999

[2413 rows x 4 columns]

In [254]:
price=pd.DataFrame({ticker:data['Volume'] for ticker, data in all_data.items()})

In [256]:
price

                   AAPL         IBM         MSFT      GOOD
Date
2009-12-31   88102700.0   4223400.0   31929700.0   45300.0
2010-01-04  123432400.0   6155300.0   38409100.0   30600.0
2010-01-05  150476200.0   6841400.0   49749600.0   46100.0
2010-01-06  138040000.0   5605300.0   58182400.0   26100.0
2010-01-07  119282800.0   5840600.0   50559700.0   14400.0
2010-01-08  111902700.0   4197200.0   51197400.0   21000.0
2010-01-11  115557400.0   5730400.0   68754700.0    9700.0
2010-01-12  148614900.0   8081500.0   65912100.0   21800.0
2010-01-13  151473000.0   6455400.0   51863500.0   29300.0
2010-01-14  108223500.0   7111800.0   63228100.0   22400.0
2010-01-15  148516900.0   8494400.0   79913200.0   54400.0
2010-01-19  182501900.0  13916200.0   46575700.0   81700.0
2010-01-20  153038200.0  15197500.0   54849500.0   25900.0
2010-01-21  152038600.0   9608600.0   73086700.0   36800.0
2010-01-22  220441900.0  10088600.0  102004600.0   56600.0
2010-01-25  266424900.0   5738500.0   63373000.0   25400.0
2010-01-26  466777500.0   7135300.0   66639900.0   37800.0
2010-01-27  430642100.0   8719200.0   63949500.0   39800.0
2010-01-28  293375600.0   9622200.0  117513700.0   36400.0
2010-01-29  311488100.0  11571200.0  193888500.0   83700.0
2010-02-01  187469100.0   7242900.0   85931100.0   31200.0
2010-02-02  174585600.0   5899900.0   54413700.0   33600.0
2010-02-03  153832000.0   4177100.0   61397900.0   46300.0
2010-02-04  189413000.0   9126900.0   77850000.0   36200.0
2010-02-05  212576700.0   8617000.0   80960100.0   30400.0
2010-02-08  119567700.0   5718500.0   52820600.0   46200.0
2010-02-09  158221700.0   6044500.0   59195800.0   37100.0
2010-02-10   92590400.0   5219100.0   48591300.0   41200.0
2010-02-11  137586400.0   5089000.0   65993700.0   32400.0
2010-02-12  163867200.0   8017700.0   81117200.0   57400.0
...                 ...         ...          ...       ...
2019-06-21   47800600.0   5288700.0   36727900.0  153600.0
2019-06-24   18220400.0   2186000.0   20628800.0   97700.0
2019-06-25   21070300.0   2801200.0   33327400.0   71100.0
2019-06-26   26067500.0   2284600.0   23657700.0  110900.0
2019-06-27   20899700.0   2149800.0   16557500.0  234500.0
2019-06-28   31110600.0   6153900.0   30043000.0  655900.0
2019-07-01   27316700.0   3377700.0   22654200.0  117900.0
2019-07-02   16935200.0   2409700.0   15237800.0   88800.0
2019-07-03   11362000.0   1930400.0   13629300.0   67500.0
2019-07-05   17265500.0   2134700.0   18141100.0  277600.0
2019-07-08   25338600.0   2395300.0   16779700.0   82300.0
2019-07-09   20578000.0   3365200.0   19953100.0   68200.0
2019-07-10   17897100.0   2513900.0   24204400.0   87900.0
2019-07-11   20191800.0   2132900.0   22327900.0  147400.0
2019-07-12   17595200.0   2786200.0   18936800.0   73300.0
2019-07-15   16947400.0   2368300.0   16651500.0   81300.0
2019-07-16   16866800.0   3474700.0   22726100.0   77600.0
2019-07-17   14107500.0   6064300.0   20211000.0   87200.0
2019-07-18   18582200.0  12695400.0   30808700.0   73100.0
2019-07-19   20929300.0   7290700.0   48992400.0   84800.0
2019-07-22   22277900.0   4092600.0   25074900.0   58100.0
2019-07-23   18355200.0   3742200.0   18034600.0   67800.0
2019-07-24   14991600.0   2952400.0   20738300.0   85800.0
2019-07-25   13909600.0   3102100.0   18356900.0   60000.0
2019-07-26   17618900.0   2904300.0   19037600.0   79000.0
2019-07-29   21673400.0   2075500.0   16605900.0   64600.0
2019-07-30   33935700.0   2632700.0   16846500.0   93500.0
2019-07-31   69281400.0   3722900.0   38598800.0  174500.0
2019-08-01   54017900.0   6344000.0   40557500.0  104700.0
2019-08-02   38688200.0   8080100.0   30199700.0   85900.0

[2413 rows x 4 columns]

In [257]:
returns=price.pct_change()

In [259]:
returns.tail()

                AAPL       IBM      MSFT      GOOD
Date
2019-07-29  0.230122 -0.285370 -0.127731 -0.182278
2019-07-30  0.565776  0.268465  0.014489  0.447368
2019-07-31  1.041549  0.414100  1.291206  0.866310
2019-08-01 -0.220312  0.704048  0.050745 -0.400000
2019-08-02 -0.283789  0.273660 -0.255386 -0.179561

In [260]:
returns['MSFT'].corr(returns['IBM'])

0.3681922759835066

In [261]:
returns['MSFT'].cov(returns['IBM'])

0.0679239894709776

In [262]:
returns.corr()

          AAPL       IBM      MSFT      GOOD
AAPL  1.000000  0.295424  0.358902  0.137323
IBM   0.295424  1.000000  0.368192  0.163142
MSFT  0.358902  0.368192  1.000000  0.163401
GOOD  0.137323  0.163142  0.163401  1.000000

In [263]:
returns.corrwith(returns.IBM)

AAPL    0.295424
IBM     1.000000
MSFT    0.368192
GOOD    0.163142
dtype: float64

In [264]:
to_match=pd.Series(['c','a','b','b','c','a'])

In [265]:
ua=pd.Series(['c','b','a'])

In [267]:
pd.Index(ua).get_indexer(to_match)

array([0, 2, 1, 1, 0, 2], dtype=int64)

In [269]:
to_match.value_counts()

a    2
c    2
b    2
dtype: int64

In [270]:
data=pd.DataFrame({'q1':[1,3,4,3,4],
                  'q2':[2,3,1,2,3],
                  'q3':[1,5,2,4,4]})

In [271]:
data

   q1  q2  q3
0   1   2   1
1   3   3   5
2   4   1   2
3   3   2   4
4   4   3   4

In [273]:
data.apply(pd.value_counts).fillna(0)

    q1   q2   q3
1  1.0  1.0  1.0
2  0.0  2.0  1.0
3  2.0  2.0  0.0
4  2.0  0.0  2.0
5  0.0  0.0  1.0